app/Http/Controllers/ApiController.php

select * from `obras` where `obras`.`id` = '2' and `obras`.`deleted_at` is null limit 1
---
    public function selecionar_obra(Request $Request)
    {
        if (Session::get('usuario_vinculo')['id_nivel'] <= 2) {

            Log::info('Trocou para obra ' . $Request->id_obra);

            $obra = CadastroObra::find($Request->id_obra);