app/Http/Controllers/AtivoExternoController.php

    public function searchAtivoLista(Request $request){

        if ($request->ajax()) {

            $listaAtivos = AtivoExterno::select('ativos_configuracoes.titulo AS categoria', 'ativos_externos.*')->join('ativos_configuracoes', 'ativos_configuracoes.id', '=', 'ativos_externos.id_ativo_configuracao')->orderBy('ativos_externos.titulo', 'ASC')->get();
---
select `ativos_configuracoes`.`titulo` as `categoria`, `ativos_externos`.* from `ativos_externos` inner join `ativos_configuracoes` on `ativos_configuracoes`.`id` = `ativos_externos`.`id_ativo_configuracao` order by `ativos_externos`.`titulo` asc