app/Http/Controllers/CadastroFuncionarioController.php

    public function index()
    {

        $id_obra = Session::get('obra')['id'] ?? null;

        if ($id_obra !== null && $id_obra > 0) {
            $lista = CadastroFuncionario::where('id_obra', $id_obra)->with('obra')->get();
        } else {
            $lista = CadastroFuncionario::with('obra')->get();
---
select `obras`.`razao_social`, `funcionarios`.* from `funcionarios` inner join `obras` on `obras`.`id` = `funcionarios`.`id_obra`