app/Http/Controllers/FerramentalRetiradaController.php

select * from `funcionarios`
select * from `obras` where `obras`.`deleted_at` is null
---
    public function index()
    {
        $retiradas = FerramentalRetirada::with('obra', 'usuario', 'funcionario', 'situacao')->get();

insert into `ativos_ferramental_retirada` (`id_relacionamento`, `id_obra`, `id_usuario`, `id_funcionario`, `data_devolucao_prevista`, `data_devolucao`, `status`, `observacoes`, `updated_at`, `created_at`) values ('', '1', 1, '1', '2023-04-14T16:13', '', 1, '', '2023-04-13 16:13:35', '2023-04-13 16:13:35')
---
    public function store(Request $request)
    {
        // dd($request->all());
        $request->validate(
            [
                'id_obra' => 'required',
                'id_funcionario' => 'required',
                'id_ativo_externo' => 'required',
                'devolucao_prevista' => 'required'
            ],
            [
                'id_obra.required' => 'Qual obra você deseja efetivar esta retirada?',
                'id_funcionario.required' => 'Você precisa selecionar o funcionário.',
                'id_ativo_externo.required' => 'Nenhum item foi selecionado para retirada.',
                'devolucao_prevista.required' => 'Preencha a data e hora para devolução.'
            ]
        );

        $retirada = new FerramentalRetirada();
        $retirada->id_relacionamento = null;
        $retirada->id_obra = $request->id_obra;
        $retirada->id_usuario = Auth::user()->id ?? 1;
        $retirada->id_funcionario = $request->id_funcionario;
        $retirada->data_devolucao_prevista = $request->devolucao_prevista;
        $retirada->data_devolucao = null;
        $retirada->status = 1;
        $retirada->observacoes = $request->observacoes ?? NULL;
        $retirada->save();

select * from `ativos_ferramental_retirada` where `ativos_ferramental_retirada`.`id` = 22 limit 1
---
    public function update(Request $request, $id)
    {
        $request->validate(
            [
                'id_obra' => 'required',
                'id_funcionario' => 'required',
                'id_ativo_externo' => 'required',
                'devolucao_prevista' => 'required'
            ],
            [
                'id_obra.required' => 'Qual obra você deseja efetivar esta retirada?',
                'id_funcionario.required' => 'Você precisa selecionar o funcionário.',
                'id_ativo_externo.required' => 'Nenhum item foi selecionado para retirada.',
                'devolucao_prevista.required' => 'Preencha a data e hora para devolução.'
            ]
        );

        $retirada = FerramentalRetirada::find($id);

select * from `ativos_ferramental_retirada` where `ativos_ferramental_retirada`.`id` = 11 limit 1
select * from `ativos_ferramental_retirada_item` where `ativos_ferramental_retirada_item`.`id_retirada` = 11 limit 1
---
    public function destroy($id)
    {
        $retirada = FerramentalRetirada::findOrFail($id);
        $retirada->status = 6;

        $itens = FerramentalRetiradaItem::where('id_retirada', $retirada->id)->get();