app/Http/Controllers/FerramentalRetiradaController.php

update `ativos_ferramental_retirada` set `termo_responsabilidade_gerado` = '2023-04-14 09:20:30', `ativos_ferramental_retirada`.`updated_at` = '2023-04-14 09:20:30' where `id` = 22
---
    public function termo(int $id)
    {
        /** Get Detalhes */
        $detalhes = FerramentalRetirada::getRetiradaItems($id);

        /** Nome do Arquivo */
        $termo_responsabilidade = 'termo_retirada_' . date("dmYHis") . '.pdf';

        $termo = FerramentalRetirada::find($id);
        $termo->termo_responsabilidade_gerado = now();
        $termo->save();

select * from `ativos_ferramental_retirada` where `ativos_ferramental_retirada`.`id` = 20 limit 1
---
    public function devolver_salvar(Request $request)
    {

        if ($request->id_ativo_externo) {
            foreach ($request->id_ativo_externo as $key => $value) {

                dd($request->id_ativo_externo);




                /** Salvar Retirada Item */
                $item = FerramentalRetiradaItemDevolver::find($key);
                $item->status = $value ?? 1;
                $item->save();

                /** Salvar Retirada */
                $retirada = FerramentalRetirada::find($item->id_retirada);