app/Models/AtivoExternoEstoque.php

    static function getAtivosExternoEstoque()
    {
        $estoque = DB::table('ativos_externos_estoque')
        ->select(
            'obras.codigo_obra',
            'obras.razao_social',
            'ativos_externos.titulo as item',
            'ativos_externos_estoque.patrimonio',
            'ativos_externos_estoque.id_ativo_externo',
            'ativos_externos_estoque.id as id_ativo_externo_item'
        )
        ->join('ativos_externos', 'ativos_externos.id', '=', 'ativos_externos_estoque.id_ativo_externo')
        ->join('obras', 'obras.id', '=', 'ativos_externos_estoque.id_obra')
        ->where('ativos_externos_estoque.status', 4)
        ->get();
---
select `obras`.`codigo_obra`, `obras`.`razao_social`, `ativos_externos`.`titulo` as `item`, `ativos_externos_estoque`.`patrimonio`, `ativos_externos_estoque`.`id_ativo_externo`, `ativos_externos_estoque`.`id` as `id_ativo_externo_item` from `ativos_externos_estoque` inner join `ativos_externos` on `ativos_externos`.`id` = `ativos_externos_estoque`.`id_ativo_externo` inner join `obras` on `obras`.`id` = `ativos_externos_estoque`.`id_obra` where `ativos_externos_estoque`.`status` = 4