app/Models/ConfiguracaoModulo.php

    static function get_modulos_permitidos()
    {

        if (Auth::check() && isset(Session::get('usuario_vinculo')['id_nivel'])) {
            $permissoes = json_decode((ConfiguracaoUsuarioNiveis::find(Session::get('usuario_vinculo')['id_nivel']))->permissoes);

            if(count((array)$permissoes)==0){
                return [];
            } else {
                foreach ($permissoes as $id_modulo => $p) {
                    $modulo[$id_modulo] = ConfiguracaoModulo::orderBy('posicao', 'ASC')->find($id_modulo)->toArray();
                    foreach ($p as $id_sub_modulo => $submodulo) {
                        $modulo[$id_modulo]['submodulo'][] = ConfiguracaoModulo::orderBy('posicao', 'ASC')->find($id_sub_modulo)->toArray();
---
select * from `modulos` where `modulos`.`id` = '7' order by `posicao` asc limit 1