app/Models/FerramentalRetirada.php

    static function getRetirada()
    {
        return DB::table('ativos_ferramental_retirada')
            ->select(
                'ativos_ferramental_retirada.*',
                'users.name as solicitante',
                'funcionarios.nome as funcionario',
                'funcionarios.matricula as funcionario_matricula',
                'obras.codigo_obra',
                'obras.razao_social',
                'ativos_ferramental_retirada_autenticacao.termo_responsabilidade'
            )
            ->join("users", "users.id", "=", "ativos_ferramental_retirada.id_usuario")
            ->join("funcionarios", "funcionarios.id", "=", "ativos_ferramental_retirada.id_funcionario")
            ->join("obras", "obras.id", "=", "ativos_ferramental_retirada.id_obra")
            ->join("ativos_ferramental_retirada_autenticacao", "ativos_ferramental_retirada_autenticacao.id_retirada", "=", "ativos_ferramental_retirada.id")
            // ->groupBy('ativos_ferramental_retirada_autenticacao.id_retirada')
            ->get();
---
select `ativos_ferramental_retirada`.*, `users`.`name` as `solicitante`, `funcionarios`.`nome` as `funcionario`, `funcionarios`.`matricula` as `funcionario_matricula`, `obras`.`codigo_obra`, `obras`.`razao_social` from `ativos_ferramental_retirada` inner join `users` on `users`.`id` = `ativos_ferramental_retirada`.`id_usuario` inner join `funcionarios` on `funcionarios`.`id` = `ativos_ferramental_retirada`.`id_funcionario` inner join `obras` on `obras`.`id` = `ativos_ferramental_retirada`.`id_obra`
select * from `ativos_ferramental_retirada_autenticacao` where `id_retirada` = 11
select `ativos_ferramental_retirada`.*, `users`.`name` as `solicitante`, `funcionarios`.`nome` as `funcionario`, `funcionarios`.`matricula` as `funcionario_matricula`, `obras`.`codigo_obra`, `obras`.`razao_social`, `ativos_ferramental_retirada_autenticacao`.`termo_responsabilidade` from `ativos_ferramental_retirada` inner join `users` on `users`.`id` = `ativos_ferramental_retirada`.`id_usuario` inner join `funcionarios` on `funcionarios`.`id` = `ativos_ferramental_retirada`.`id_funcionario` inner join `obras` on `obras`.`id` = `ativos_ferramental_retirada`.`id_obra` inner join `ativos_ferramental_retirada_autenticacao` on `ativos_ferramental_retirada_autenticacao`.`id_retirada` = `ativos_ferramental_retirada`.`id`

    static function getRetiradaItems(int $id)
    {
        $retirada = DB::table('ativos_ferramental_retirada')
            ->select(
                'ativos_ferramental_retirada.*',
                'users.name',
                'funcionarios.nome as funcionario',
                'funcionarios.matricula as funcionario_matricula',
                'obras.codigo_obra',
                'obras.razao_social'
            )
            ->join("users", "users.id", "=", "ativos_ferramental_retirada.id_usuario")
            ->join("funcionarios", "funcionarios.id", "=", "ativos_ferramental_retirada.id_funcionario")
            ->join("obras", "obras.id", "=", "ativos_ferramental_retirada.id_obra")
            ->where('ativos_ferramental_retirada.id', $id)
            ->first();


        if ($retirada) {

            /** Faz a busca dos itens de acordo com a retirada */
            $retirada->itens = DB::table('ativos_ferramental_retirada_item')

                ->select(
                    'ativos_ferramental_retirada_item.*',
                    'ativos_externos_estoque.patrimonio as item_codigo_patrimonio',
                    'ativos_externos.titulo as item_nome'
                )

                ->join("ativos_externos_estoque", "ativos_externos_estoque.id", "=", "ativos_ferramental_retirada_item.id_ativo_externo")
                ->join("ativos_externos", "ativos_externos.id", "=", "ativos_externos_estoque.id_ativo_externo")
                ->where('ativos_ferramental_retirada_item.id_retirada', $id)
                ->get();

            /** Verifica se tem anexo */
            $retirada->anexo = DB::table('anexos')
                ->where('id_item', $id)
                ->where('id_modulo', '18') // Retirada
                ->get()
                ->first();

            /** Verifica se o termo já foi assinado digitalmente */
            $retirada->autenticado = DB::table('ativos_ferramental_retirada_autenticacao')->where('id_retirada', $id)->get()->first();
---
select `ativos_ferramental_retirada_item`.*, `ativos_externos_estoque`.`patrimonio` as `item_codigo_patrimonio`, `ativos_externos`.`titulo` as `item_nome` from `ativos_ferramental_retirada_item` inner join `ativos_externos_estoque` on `ativos_externos_estoque`.`id` = `ativos_ferramental_retirada_item`.`id_ativo_externo` inner join `ativos_externos` on `ativos_externos`.`id` = `ativos_externos_estoque`.`id_ativo_externo` where `ativos_ferramental_retirada_item`.`id_retirada` = 22
select * from `anexos` where `id_item` = 22 and `id_modulo` = '18'
select * from `ativos_ferramental_retirada_autenticacao` where `id_retirada` = 15