app/Providers/ViewServiceProvider.php

select * from `empresas` where `empresas`.`deleted_at` is null
---
    public function boot()
    {
        //
        view()->composer('*', function($view) {
            $view->with(['modulos' => ConfiguracaoModulo::get_modulos_permitidos(), 'empresas_lista' => CadastroEmpresa::all()]);