app/Providers/ViewServiceProvider.php

    public function boot()
    {
        //
        view()->composer('*', function($view) {
            $view->with(
                [
                    'modulos_permitidos' => ConfiguracaoModulo::get_modulos_permitidos(),
                    'obras_lista' => CadastroObra::all()
---
select * from `obras` where `obras`.`deleted_at` is null